// Задание №3
// В двух строках str1 и str2 хранятся данные "Hello" и "World". Вывести на экран значение конкотенации этих двух строк: "Hello World".
public class task_03 {
    public static void main(String [] args){
        String str1 = "Hello";
        String str2 = "World";

        System.out.println(str1 + " " + str2);
        
     } 
}
